charles-waite/Matter-over-Thread-Clock-and-Sensor-Suite/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

# Flash configuration
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Matter + Thread
CONFIG_ENABLE_MATTER_OVER_THREAD=y
CONFIG_ESP_MATTER_ENABLE_MATTER_SERVER=y
CONFIG_ESP_MATTER_ENABLE_OPENTHREAD=y
CONFIG_ESP_MATTER_ENABLE_DATA_MODEL=y

# OpenThread
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_RX_ON_WHEN_IDLE=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y

# BLE commissioning (Thread-only)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# Disable Wi-Fi
CONFIG_ENABLE_WIFI_STATION=n

# Matter device identity
CONFIG_CHIP_PROJECT_CONFIG="main/chip_project_config.h"
CONFIG_USE_TEST_SERIAL_NUMBER="001"
CONFIG_DEVICE_SOFTWARE_VERSION_NUMBER=100
CONFIG_DEFAULT_DEVICE_HARDWARE_VERSION=1

# Crypto
CONFIG_MBEDTLS_HKDF_C=y

# Disable unused clusters that currently fail to compile in esp-matter
CONFIG_SUPPORT_CLOSURE_CONTROL_CLUSTER=n
CONFIG_SUPPORT_CLOSURE_DIMENSION_CLUSTER=n
